{"meta":{"title":"Xiaoyu Xie's Blog","subtitle":"Machine Learning, Deep Learning, Computer Vision","description":"Track The past. Organize the present. Design the future.","author":"Xiaoyu Xie","url":"http://example.com","root":"/"},"pages":[{"title":"Xiaoyu Xie","date":"2022-02-24T03:13:40.426Z","updated":"2022-02-24T03:13:40.426Z","comments":true,"path":"about/index.html","permalink":"http://example.com/about/index.html","excerpt":"","text":"BackgroundI am a second-year PhD student in Mechanical Engineering at Northwestern University. Before that, I graduated from University of Chinese Academy of Sciences and China University of Mining and Technology with master and undergraduate degree respectively. Research Interests: Scientific/Mechanistic Machine Learning; Deep Learning in Manufacturing and Mechanics; Computer Vision; Publications Xie, X., Liu, W. K., &amp; Gan, Z. (2021). Data-driven discovery of dimensionless numbers and scaling laws from experimental measurements. ArXiv:2111.03583 [Physics]. http://arxiv.org/abs/2111.03583 Xie, X., Bennett, J., Saha, S., Lu, Y., Cao, J., Liu, W. K., &amp; Gan, Z. (2021). Mechanistic data-driven prediction of as-built mechanical properties in metal additive manufacturing. Npj Computational Materials, 7(1), 1–12. https://doi.org/10.1038/s41524-021-00555-z Mozaffar, M., Liao, S., Xie, X., Saha, S., Park, C., Cao, J., Liu, W. K., &amp; Gan, Z. (2021). Mechanistic artificial intelligence (Mechanistic-AI) for modeling, design, and control of advanced manufacturing processes: Current state and perspectives. Journal of Materials Processing Technology, 117485. https://doi.org/10.1016/j.jmatprotec.2021.117485 Saha, S., Gan, Z., Cheng, L., Gao, J., Kafka, O. L., Xie, X., Li, H., Tajdari, M., Kim, H. A., &amp; Liu, W. K. (2021). Hierarchical Deep Learning Neural Network (HiDeNN): An artificial intelligence (AI) framework for computational science and engineering. Computer Methods in Applied Mechanics and Engineering, 373, 113452. https://doi.org/10.1016/j.cma.2020.113452 Conference Presentation 16th U.S. National Congress on Computational Mechanics (USNCCM16) - July 25-29, 2021 - Virtual Event-[Conference award] Mechanistic Machine Learning and Digital Twins for Computational Science, Engineering &amp; Technology (MMLDT-CSET 2021) - Sep. 2021, San Diego, USA-[Fellowship award] Machine Learning related courses I have takenNorthwestern University: Machine Learning: Foundations, Applications, and Algorithms Statistical Pattern Recognition Mechanistic Data Science for Engineering Engineering Optimization for Product Design and Manufacturing High Performance Computing for Multiphysics Applications Coursera: Deep Learning Specialization Neural Networks and Deep Learning Improving Deep Neural Networks: Hyperparameter tuning, Regularization and Optimization Structuring Machine Learning Projects Convolutional Neural Networks Sequence Models Bayesian Statistics: From Concept to Data Analysis Generative Adversarial Networks (GANs) Specialization Build Basic Generative Adversarial Networks (GANs) Build Better Generative Adversarial Networks (GANs) Apply Generative Adversarial Networks (GANs) Online courses: Machine Lerning by Hung-yi Lee"}],"posts":[],"categories":[],"tags":[]}