{"meta":{"title":"Xiaoyu Xie's Blog","subtitle":"Machine Learning, Deep Learning, Computer Vision","description":"Track The past. Organize the present. Design the future.","author":"Xiaoyu Xie","url":"http://example.com","root":"/"},"pages":[{"title":"Publications","date":"2022-12-26T13:32:06.000Z","updated":"2023-06-12T03:37:35.137Z","comments":true,"path":"Publications/index.html","permalink":"http://example.com/Publications/index.html","excerpt":"","text":"Journals: Xie, X., Samaei, A., Guo, J., Liu, W. K., &amp; Gan, Z., (2022). Data-driven discovery of dimensionless numbers and governing laws from scarce measurements. Nature Communications, 13, 7562. https://doi.org/10.1038/s41467-022-35084-w Xie, X., Liu, W. K., &amp; Gan, Z. (2021). Data-driven discovery of dimensionless numbers and scaling laws from experimental measurements. arXiv preprint arXiv:2111.03583. Xie, X., Bennett, J., Saha, S., Lu, Y., Cao, J., Liu, W. K., &amp; Gan, Z. (2021). Mechanistic data-driven prediction of as-built mechanical properties in metal additive manufacturing. Npj Computational Materials - Nature, 7(1), 1–12. https://doi.org/10.1038/s41524-021-00555-z Mozaffar, M., Liao, S., Xie, X., Saha, S., Park, C., Cao, J., Liu, W. K., &amp; Gan, Z. (2021). Mechanistic artificial intelligence (Mechanistic-AI) for modeling, design, and control of advanced manufacturing processes: Current state and perspectives. Journal of Materials Processing Technology, 117485. https://doi.org/10.1016/j.jmatprotec.2021.117485 Amin, A., Li, Y., Lu, Y., Xie, X., Mojumder, S., Gan, Z., Wagner, G., &amp; Liu, W. K. (2023). Physics Guided Heat Source for Quantitative Prediction of the Laser Track Measurements of IN718 in 2022 NIST AM Benchmark Test. Saha, S., Gan, Z., Cheng, L., Gao, J., Kafka, O. L., Xie, X., Li, H., Tajdari, M., Kim, H. A., &amp; Liu, W. K. (2021). Hierarchical Deep Learning Neural Network (HiDeNN): An artificial intelligence (AI) framework for computational science and engineering. Computer Methods in Applied Mechanics and Engineering, 373, 113452. https://doi.org/10.1016/j.cma.2020.113452 Xue, T., Liao, S., Gan, Z., Park, C., Xie, X., Liu, W. K., &amp; Cao, J. (2023). JAX-FEM: A differentiable GPU-accelerated 3D finite element solver for automatic inverse design and mechanistic data science. Computer Physics Communications, 108802. Zhang, L., Yu, G., Li, S., He, X., Xie, X., Xia, C., Ning, W., &amp; Zheng, C. (2019). The effect of laser surface melting on grain refinement of phase separated Cu-Cr alloy. Optics &amp; Laser Technology, 119, 105577. https://doi.org/10.1016/j.optlastec.2019.105577 Patents: Liu, W. K., Saha, S., Mojumder, S., Suarez, D., Lu, Y., Li, H., Xie, X., Gan, Z., Invention ID: Disc-ID-NU2021-102-01 (Invention disclosure filed on April 21, 2021), Title: HiDeNN: An AI Platform for Scientific and Materials Systems Innovation (Serial No. 63/177,517)”. Yu, G., Xie, X., et al. An evaluation method for the relationship between plasma and final modification effect during laser modification, CN 106296649 A, (Granted patent; Chinese patent) Talks Xie, X., Samaei, A., Guo, J., Gan, Z., Liu, W., Data-driven discovery of dimensionless numbers and governing laws from scarce measurements, Scientific Machine Learning Webinar, Carnegie Mellon University, March, 2023. Xie, X., Gan, Z., Liu, W., Dimensionless learning for discovering new dimensionless numbers, 16th U.S. National Congress on Computational Mechanics (USNCCM16), July 25-29, 2021, Virtual Event. Xie, X., Gan, Z., Saha, S., Liu, W., Mechanistic digital twin of metal additive manufacturing, Mechanistic Machine Learning and Digital Twins for Computational Science, Engineering &amp; Technology (MMLDT-CSET 2021), Sep. 2021, San Diego, USA. Video Codes PyDimension: A Python package for automatically data-driven scientific discovery; PyDimension Documentation: Online documentation and tutorials for PyDimension; DL-AM: An implementation for our paper called [Mechanistic data-driven prediction of as-built mechanical properties in metal additive manufacturing](https://www.nature.com/articles/s41524-021-00555-z];"},{"title":"Research","date":"2022-12-26T14:33:18.000Z","updated":"2023-01-18T20:46:19.636Z","comments":true,"path":"Research/index.html","permalink":"http://example.com/Research/index.html","excerpt":"","text":"1. Physics for AI1.1 Dimensionless Learning (Dimensional Analysis + Machine Learning) for scientific discovery Dimensionless learning combines fundamental physics principles with state-of-the-art machine learning techniques to solve scientific and engineering problems. By embedding the principle of dimensional invariance into a two-level machine learning scheme, it can automatically discover dominant dimensionless numbers and governing laws (scaling laws and differential equations) from noisy and scarce measurements. Xie, X., Samaei, A., Guo, J., Liu, W. K., &amp; Gan, Z., (2022). Data-driven discovery of dimensionless numbers and governing laws from scarce measurements. Nature Communications, 13, 7562. https://doi.org/10.1038/s41467-022-35084-w. Code. 1.2 Dimensionally invariant Neural Network (DimensionNet) for scientific discovery The DimensionNet reduces the dimensionality of the original input parameters by automatically discovering a smaller set of governing dimensionless numbers and transforming the high-dimensional inputs to the dimensionless set. Saha, S., Gan, Z., Cheng, L., Gao, J., Kafka, O. L., Xie, X., Li, H., Tajdari, M., Kim, H. A., &amp; Liu, W. K. (2021). Hierarchical Deep Learning Neural Network (HiDeNN): An artificial intelligence (AI) framework for computational science and engineering. Computer Methods in Applied Mechanics and Engineering, 373, 113452. Paper 2. AI for physicsAI-empowered scientific discovery and digital twin in additive manufacturing Metal additive manufacturing provides remarkable flexibility in geometry and component design, but localized heating/cooling heterogeneity leads to spatial variations of as-built mechanical properties, significantly complicating the materials design process. To this end, we develop a mechanistic data-driven framework integrating wavelet transforms and convolutional neural networks to predict location-dependent mechanical properties over fabricated parts based on process-induced temperature sequences, i.e., thermal histories. The framework enables multiresolution analysis and importance analysis to reveal dominant mechanistic features underlying the additive manufacturing process, such as critical temperature ranges and fundamental thermal frequencies. We systematically compare the developed approach with other machine learning methods. The results demonstrate that the developed approach achieves reasonably good predictive capability using a small amount of noisy experimental data. It provides a concrete foundation for a revolutionary methodology that predicts spatial and temporal evolution of mechanical properties leveraging domain-specific knowledge and cutting-edge machine and deep learning technologies. Xie, X., Bennett, J., Saha, S., Lu, Y., Cao, J., Liu, W. K., &amp; Gan, Z. (2021). Mechanistic data-driven prediction of as-built mechanical properties in metal additive manufacturing. Npj Computational Materials, 7(1), 1–12.Paper"},{"title":"Awards","date":"2022-12-26T14:37:36.000Z","updated":"2022-12-26T14:37:48.849Z","comments":true,"path":"Awards/index.html","permalink":"http://example.com/Awards/index.html","excerpt":"","text":"Additive Manufacturing Benchmark Challenge Awards, National Institute of Standards and Technology, US, 2022: CHAL-A-AMB2022-01-Scan-MWD &amp; ASR Scan Geometry, 1st place CHAL-AMB2022-03-PSCR Pad Solid Cooling Rate, 1st place CHAL-AMB2022-03-PMPG Pad Melt Pool Geometry, 1st place CHAL-AMB2022-03-TTAM Track Time Above Melting Temperature, 2nd place Predictive Science and Engineering Design Fellowship, Northwestern University, 2021 Mechanistic Machine Learning and Digital Twins for Computational Science, Engineering &amp; Technology (MMLDT-CSET 2021) NSF Fellowship, 2021 16th U.S. National Congress on Computational Mechanics (USNCCM16) conference award, July 25-29, 2021 Water P. Murphy Fellowship, Northwestern University, 2020"},{"title":"Teaching","date":"2022-12-26T13:38:48.000Z","updated":"2023-06-12T03:32:51.379Z","comments":true,"path":"Teaching/index.html","permalink":"http://example.com/Teaching/index.html","excerpt":"","text":"CEE-ME395: Deep Learning Discrete Calculus (DLDC) for Engineering Applications, 2023-spring, Northwestern University Prepare lectures about data-driven PDE discovery and differentiable simulation for inverse design. EA3: Engineering Analysis 3, 2022-spring, Northwestern University Teaching Assistant; CEE/ME 327: Finite Elements Methods in Mechanics, 2022-fall, Northwestern University Teaching Assistant ME 395: Mechanistic Data Science Tutorials, Training, and Research Experience, 2019 - 2022, Northwestern University Teaching Assistant and mentor"},{"title":"Media","date":"2022-12-31T01:51:11.000Z","updated":"2022-12-31T01:52:22.579Z","comments":true,"path":"Media/index.html","permalink":"http://example.com/Media/index.html","excerpt":"","text":"集智俱乐部-无量纲学习：机器学习识别无量纲数与标度律"}],"posts":[{"title":"Xiaoyu Xie","slug":"index","date":"2023-06-12T03:16:41.254Z","updated":"2023-06-12T03:16:41.254Z","comments":true,"path":"2023/06/11/index/","link":"","permalink":"http://example.com/2023/06/11/index/","excerpt":"","text":"HomeWelcome to my academic website! I am Xiaoyu Xie, a third-year PhD candidate in Mechanical Engineering Department at Northwestern University. I am supervised by Prof. Wing Kam Liu. My research focuses on developing robust and flexible artificial intelligence (AI) algorithms to discover hidden patterns and knowledge from data in manufacturing, fluid mechanics, and solid mechanics. My goal is to improve the interpretability, generalization, and small-dataset scalability of AI algorithms by incorporating existing scientific insight. My research in dimensionless learning is a prime example of this approach, as it incorporates fundamental physical invariance to discover multiple levels of knowledge through machine learning. News [06/2023]: I am currently engaged in a three-month Research Internship at Mitsubishi Electric Research Laboratories. [03/2023]: I was invited to give a talk on “Data-Driven Identification of Dimensionless Numbers and Governing Laws from Limited Measurements” as part of the Scientific Machine Learning Webinar Series at Carnegie Mellon University. The recording can be found here: CMU talk recording. [12/2022]: Our official PyDimension Documentation for dimensionless learning was released, in which you can try different tutorials and examples interactively! [11/2022]: I have been coordinating a weekly AI and Science Reading Group affiliated with the Northwestern Institute on Complex Systems (NICO). We held more than 15 meetings until March 2023. Please feel free to reach out to me if you are interested in it. [12/2022]: Our latest work called “Data-driven discovery of dimensionless numbers and governing laws from scarce measurements” was published on Nature Communications! [08/2022]: Our team won three 1st places and two 2nd places in Additive Manufacturing Benchmark Challenge (AM-Bench), NIST, US, 2022! Research interests: Scientific/Mechanistic Machine Learning, AI for science; Data-driven scientific discovery; Machine Learning; Computer Vision; Education Northwestern University, Evanston, IL, US Ph.D. candidate in Mechanical Engineering, Sep. 2020 – Present Advisor: Prof. Wing Kam Liu University of Chinese Academy of Sciences, Beijing, China Inistitute of Mechanics M.S. in General and Fundamental Mechanics, Sep. 2014 – Jul. 2017","categories":[],"tags":[]}],"categories":[],"tags":[]}