{"meta":{"title":"Xiaoyu Xie's Blog","subtitle":"Machine Learning, Deep Learning, Computer Vision","description":"Track The past. Organize the present. Design the future.","author":"Xiaoyu Xie","url":"http://example.com","root":"/"},"pages":[{"title":"Research","date":"2022-02-26T02:28:51.000Z","updated":"2022-02-26T02:28:51.000Z","comments":true,"path":"Research/index.html","permalink":"http://example.com/Research/index.html","excerpt":"","text":""},{"title":"About","date":"2022-02-26T02:36:53.000Z","updated":"2022-02-26T02:36:53.000Z","comments":true,"path":"about/index.html","permalink":"http://example.com/about/index.html","excerpt":"","text":""}],"posts":[{"title":"What is Scientific Machine Learning and Physics-informed Machine Learning?","slug":"What-is-Scientific-Machine-Learning-and-Physics-informed-Machine-Learning","date":"2022-02-26T02:40:06.000Z","updated":"2022-02-26T03:18:38.000Z","comments":true,"path":"2022/02/25/What-is-Scientific-Machine-Learning-and-Physics-informed-Machine-Learning/","link":"","permalink":"http://example.com/2022/02/25/What-is-Scientific-Machine-Learning-and-Physics-informed-Machine-Learning/","excerpt":"","text":"Machine learning (ML) and deep learning (DL) have been widely applied in diverse disciplines in science and engineering due to the promising results in image recognition, natural language processing, speech recognition, etc. However, it is still challenging to discover explicit physical models from data because most ML and DL methods are black-box that cannot be interpreted by human beings. For example, Neural Network is a network composed of a series of structured neurons or nodes. Even though it can be regarded as a universal approximation to any function, it is difficult to explain the relationship for different neurons or nodes. This limitation greatly hinders the development of ML and DL in scientific problems because we desire to discover simple but powerful physical models in these problems, such as Newton’s law or Einstein’s law. Therefore, there is an emerging need to discover explicit and interpretable physical models from data using ML and DL. This emerging field is called scientific machine learning or physics-informed machine learning. One typical example is Physics-Informed Neural Networks (PINNs). The basic idea for PINNs is that since many complex dynamics systems can be described as partial differential equations, PINNs aim to inform Neural Networks with such physical knowledge to solve the equations numerically. Unlike standard ML or DL which generally need to spend a lot of time in preparing a large dataset to train a model, PINNs only need the equations governing the systems and do not need a training set. That is to say, PINNs avoid a time-consuming procedure in data collection. Another example is Dimensionless Learning, which is a physics-informed and explainable machine learning methodology. It aims to find some causal relationships between different variables in a complex system by using another fundamental physical knowledge: the dimensions or units of different variables. By incorporating physical dimensions among variables into machine learning algorithms, it can successfully reduce the high-dimensional parameter space into low-dimensional descriptions. One important advantage of the low-dimensional space is that it can be described as a few physically interpretable dimensionless parameters. Because the parameter space is reduced, dimensionless learning can work well for small datasets effectively. Despite different formulations of scientific machine learning methods, one common thing is that they want to incorporate our existing physical knowledge into ML to make the train a model efficiently and effectively. After hundreds of years of unremitting efforts of scientists, we already have tons of physical knowledge in various fields. The application of partial differential equations and physical dimensions are just a small part of them. We still have vast physical knowledge waiting to be explored.","categories":[{"name":"Blog","slug":"Blog","permalink":"http://example.com/categories/Blog/"}],"tags":[]},{"title":"About","slug":"About","date":"2022-02-26T01:22:37.000Z","updated":"2022-11-12T17:48:22.048Z","comments":true,"path":"2022/02/25/About/","link":"","permalink":"http://example.com/2022/02/25/About/","excerpt":"","text":"About meThere is a line (with modifications) from the popular TV show “Westworld”: Some people choose to see the chaos and disarray in this world. I choose to see the beauty. To believe there is an order to our days, a purpose. For me, knowledge is the beauty. It can be as simple as an equation, such as Newton’s laws of motion or the mass-energy equivalence equation. But it can show infinite power in promoting the development of our life, technology and culture. For centuries, scientists rely on assumptions, hyposis, and principals to derive equations, which build the foundations of our modern world but generally took a few decades to obtain it. Artifical Intelligence is a promising way to speedup the discovery of hidden patterns/knowledge in complex systems and phenomena. However, most of the research only focus on purely data-driven approaches. It can easily end in a blackbox model with low interpretablity, limited generalization, and relies on large dataset. To address these issues, I believe intelligence needs knowledge. We already have tons of knowledge in this world. We should find an innovative way to integrate our exitsing knowldge into machine learning and deep learning instead of solely reling on data. In this way, we specialize machine learning as Scientific/Mechanistic Machine Learning or AI4Science. My research in Dimensionless Learning is one typical approach in this direction. We incorporate a fundamental physical invariance, dimensional invariance, into machine learning to discovery three levels of knowldge, including dimensionless number at the feature level, scaling law at the algebraic equation level, and governing equation at the differential equation level. Education Northwestern University, Evanston, IL, US Ph.D. candidate in Mechanical Engineering, Sep. 2020 – Present Advisor: Prof. Wing Kam Liu University of Chinese Academy of Sciences, Beijing, China Inistitute of Mechanics M.S. in General and Fundamental Mechanics, Sep. 2014 – Jul. 2017 China University of Mining and Technology, Xuzhou, China B.S. in Engineering Mechanics, Sep. 2010 – Jul. 2014 Research interests Scientific/Mechanistic Machine Learning; Deep Learning; Computer Vision; News [10/2022]: Our latest work called “Data-driven discovery of dimensionless numbers and governing laws from scarce measurements” was accepted by Nature Communications! [08/2022]: Our team won three 1st places and two 2nd places in Additive Manufacturing Benchmark Challenge (AM-Bench), NIST, US, 2022! Research1. Dimensionless Learning for scientific discovery (scaling laws &amp; PDEs)Dimensionless numbers and scaling laws provide elegant insights into the characteristic properties of physical systems. Classical dimensional analysis and similitude theory fail to identify a set of unique dimensionless numbers for a highly-multivariable system with incomplete governing equations. … Read more In this study, we embed the principle of dimensional invariance into a two-level machine learning scheme to automatically discover dominant and unique dimensionless numbers and scaling laws from data. The proposed methodology, called dimensionless learning, can reduce high-dimensional parametric spaces into descriptions involving just a few physically-interpretable dimensionless parameters, which significantly simplifies the process design and optimization of the system. We demonstrate the algorithm by solving several challenging engineering problems with noisy experimental measurements (not synthetic data) collected from the literature. The examples include turbulent Rayleigh-Benard convection, vapor depression dynamics in laser melting of metals, and porosity formation in 3D printing. We also show that the proposed approach can identify dimensionally-homogeneous differential equations with minimal parameters by leveraging sparsity-promoting techniques. Xie, X., Liu, W. K., &amp; Gan, Z. (2021). Data-driven discovery of dimensionless numbers and scaling laws from experimental measurements. ArXiv:2111.03583 [Physics].Paper, Code. Saha, S., Gan, Z., Cheng, L., Gao, J., Kafka, O. L., Xie, X., Li, H., Tajdari, M., Kim, H. A., &amp; Liu, W. K. (2021). Hierarchical Deep Learning Neural Network (HiDeNN): An artificial intelligence (AI) framework for computational science and engineering. Computer Methods in Applied Mechanics and Engineering, 373, 113452. Paper 2. Digital twin for additive manufacturing via deep learningMetal additive manufacturing provides remarkable flexibility in geometry and component design, but localized heating/cooling heterogeneity leads to spatial variations of as-built mechanical properties, significantly complicating the materials design process. … Read more To this end, we develop a mechanistic data-driven framework integrating wavelet transforms and convolutional neural networks to predict location-dependent mechanical properties over fabricated parts based on process-induced temperature sequences, i.e., thermal histories. The framework enables multiresolution analysis and importance analysis to reveal dominant mechanistic features underlying the additive manufacturing process, such as critical temperature ranges and fundamental thermal frequencies. We systematically compare the developed approach with other machine learning methods. The results demonstrate that the developed approach achieves reasonably good predictive capability using a small amount of noisy experimental data. It provides a concrete foundation for a revolutionary methodology that predicts spatial and temporal evolution of mechanical properties leveraging domain-specific knowledge and cutting-edge machine and deep learning technologies. Xie, X., Bennett, J., Saha, S., Lu, Y., Cao, J., Liu, W. K., &amp; Gan, Z. (2021). Mechanistic data-driven prediction of as-built mechanical properties in metal additive manufacturing. Npj Computational Materials, 7(1), 1–12.Paper PublicationsJournals: Xie, X., Samaei, A., Guo, J., Liu, W. K., &amp; Gan, Z. Data-driven discovery of dimensionless numbers and universal laws from scarce measurements. Nature Communications (Accepted). Xie, X., Bennett, J., Saha, S., Lu, Y., Cao, J., Liu, W. K., &amp; Gan, Z. (2021). Mechanistic data-driven prediction of as-built mechanical properties in metal additive manufacturing. Npj Computational Materials - Nature, 7(1), 1–12. https://doi.org/10.1038/s41524-021-00555-z Mozaffar, M., Liao, S., Xie, X., Saha, S., Park, C., Cao, J., Liu, W. K., &amp; Gan, Z. (2021). Mechanistic artificial intelligence (Mechanistic-AI) for modeling, design, and control of advanced manufacturing processes: Current state and perspectives. Journal of Materials Processing Technology, 117485. https://doi.org/10.1016/j.jmatprotec.2021.117485 Saha, S., Gan, Z., Cheng, L., Gao, J., Kafka, O. L., Xie, X., Li, H., Tajdari, M., Kim, H. A., &amp; Liu, W. K. (2021). Hierarchical Deep Learning Neural Network (HiDeNN): An artificial intelligence (AI) framework for computational science and engineering. Computer Methods in Applied Mechanics and Engineering, 373, 113452. https://doi.org/10.1016/j.cma.2020.113452 Zhang, L., Yu, G., Li, S., He, X., Xie, X., Xia, C., Ning, W., &amp; Zheng, C. (2019). The effect of laser surface melting on grain refinement of phase separated Cu-Cr alloy. Optics &amp; Laser Technology, 119, 105577. https://doi.org/10.1016/j.optlastec.2019.105577 Patents: Liu, W. K., Saha, S., Mojumder, S., Suarez, D., Lu, Y., Li, H., Xie, X., Gan, Z., Invention ID: Disc-ID-NU2021-102-01 (Invention disclosure filed on April 21, 2021), Title: HiDeNN: An AI Platform for Scientific and Materials Systems Innovation (Serial No. 63/177,517)”. Yu, G., Xie, X., et al. An evaluation method for the relationship between plasma and final modification effect during laser modification, CN 106296649 A, (Granted patent; Chinese patent) Conference presentations Xie, X., Gan, Z., Liu, W., Dimensionless learning for discovering new dimensionless numbers, 16th U.S. National Congress on Computational Mechanics (USNCCM16), July 25-29, 2021, Virtual Event. Xie, X., Gan, Z., Saha, S., Liu, W., Mechanistic digital twin of metal additive manufacturing, Mechanistic Machine Learning and Digital Twins for Computational Science, Engineering &amp; Technology (MMLDT-CSET 2021), Sep. 2021, San Diego, USA. Reviewer Computational Mechanics, Springer; Teaching Teaching Assistant for Engineering Analysis 3, 2022-spring, Northwestern University Teaching Assistant for MECH_ENG 327: Finite Elements Methods in Mechanics (CEE 327), 2022-fall, Northwestern University Teaching Assistant and mentor for Mechanistic Data Science Tutorials, Training, and Research Experience, 2019 - 2022, Northwestern University Awards Additive Manufacturing Benchmark Challenge Awards, National Institute of Standards and Technology, US, 2022: CHAL-A-AMB2022-01-Scan-MWD &amp; ASR Scan Geometry, 1st place CHAL-AMB2022-03-PSCR Pad Solid Cooling Rate, 1st place CHAL-AMB2022-03-PMPG Pad Melt Pool Geometry, 1st place CHAL-AMB2022-03-TTAM Track Time Above Melting Temperature, 2nd place Predictive Science and Engineering Design Fellowship, Northwestern University, 2021 Mechanistic Machine Learning and Digital Twins for Computational Science, Engineering &amp; Technology (MMLDT-CSET 2021) NSF Fellowship, 2021 16th U.S. National Congress on Computational Mechanics (USNCCM16) conference award, July 25-29, 2021 Water P. Murphy Fellowship, Northwestern University, 2020","categories":[],"tags":[]},{"title":"Xiaoyu Xie","slug":"index","date":"2022-02-26T01:19:13.000Z","updated":"2022-02-26T01:20:00.000Z","comments":true,"path":"2022/02/25/index/","link":"","permalink":"http://example.com/2022/02/25/index/","excerpt":"","text":"BackgroundI am a second-year PhD student in Mechanical Engineering at Northwestern University. Before that, I graduated from University of Chinese Academy of Sciences and China University of Mining and Technology with master and undergraduate degree respectively. Research Interests: Scientific/Mechanistic Machine Learning; Deep Learning in Manufacturing and Mechanics; Computer Vision; Publications Xie, X., Liu, W. K., &amp; Gan, Z. (2021). Data-driven discovery of dimensionless numbers and scaling laws from experimental measurements. ArXiv:2111.03583 [Physics]. http://arxiv.org/abs/2111.03583 Xie, X., Bennett, J., Saha, S., Lu, Y., Cao, J., Liu, W. K., &amp; Gan, Z. (2021). Mechanistic data-driven prediction of as-built mechanical properties in metal additive manufacturing. Npj Computational Materials, 7(1), 1–12. https://doi.org/10.1038/s41524-021-00555-z Mozaffar, M., Liao, S., Xie, X., Saha, S., Park, C., Cao, J., Liu, W. K., &amp; Gan, Z. (2021). Mechanistic artificial intelligence (Mechanistic-AI) for modeling, design, and control of advanced manufacturing processes: Current state and perspectives. Journal of Materials Processing Technology, 117485. https://doi.org/10.1016/j.jmatprotec.2021.117485 Saha, S., Gan, Z., Cheng, L., Gao, J., Kafka, O. L., Xie, X., Li, H., Tajdari, M., Kim, H. A., &amp; Liu, W. K. (2021). Hierarchical Deep Learning Neural Network (HiDeNN): An artificial intelligence (AI) framework for computational science and engineering. Computer Methods in Applied Mechanics and Engineering, 373, 113452. https://doi.org/10.1016/j.cma.2020.113452 Conference Presentation 16th U.S. National Congress on Computational Mechanics (USNCCM16) - July 25-29, 2021 - Virtual Event-[Conference award] Mechanistic Machine Learning and Digital Twins for Computational Science, Engineering &amp; Technology (MMLDT-CSET 2021) - Sep. 2021, San Diego, USA-[Fellowship award] Machine Learning related courses I have takenNorthwestern University: Machine Learning: Foundations, Applications, and Algorithms Statistical Pattern Recognition Mechanistic Data Science for Engineering Engineering Optimization for Product Design and Manufacturing High Performance Computing for Multiphysics Applications Coursera: Deep Learning Specialization Neural Networks and Deep Learning Improving Deep Neural Networks: Hyperparameter tuning, Regularization and Optimization Structuring Machine Learning Projects Convolutional Neural Networks Sequence Models Bayesian Statistics: From Concept to Data Analysis Generative Adversarial Networks (GANs) Specialization Build Basic Generative Adversarial Networks (GANs) Build Better Generative Adversarial Networks (GANs) Apply Generative Adversarial Networks (GANs) Online courses: Machine Lerning by Hung-yi Lee","categories":[],"tags":[]}],"categories":[{"name":"Blog","slug":"Blog","permalink":"http://example.com/categories/Blog/"}],"tags":[]}